# Pandas Dataframe

## axis 0 -> rows/horizontal axis 1 -> vertical/columns

In [41]:
# while usind DataFrame D and F should be capatilize
# inplace is a keyword that is use to remove data completly from the ram/rom

In [2]:
import pandas as pd
import numpy as np

In [4]:
 # i am using data frame from github 
# here data is a dictionary
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

``` while creating DataFrame using list indexing is by default from 0 and so onn but in dictionary key is been used as index ```

In [5]:
#  creating dataframe using list

data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

df = pd.DataFrame(data_list)
df

       0   1         2      3
0   John  28  New York  65000
1   Anna  34     Paris  70000
2  Peter  29    Berlin  62000
3  Linda  42    London  85000

In [11]:
data_list2 = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
column_name = ['Name','Age','City','Salary']
df1 = pd.DataFrame(data_list2,columns = column_name)
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [14]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [15]:
# extracting a column from DataFrame
df1['Name']

0     John
1     Anna
2    Peter
3    Linda
Name: Name, dtype: object

In [16]:
df1['City']

0    New York
1       Paris
2      Berlin
3      London
Name: City, dtype: object

In [18]:
df1[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

## creating a new column

In [19]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [35]:
#  creating a new column
df1['Designation'] = ['full stact developer','data analyst','devops engineer','devops engineer']
df1

    Name  Age      City  Salary           Designation
0   John   28  New York   65000  full stact developer
1   Anna   34     Paris   70000          data analyst
2  Peter   29    Berlin   62000       devops engineer
3  Linda   42    London   85000       devops engineer

In [39]:
# how to remove a column
df1.drop('Designation',axis=1,inplace=True)
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [40]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [42]:
# for selecting specific data
df1.loc[0]

Name          John
Age             28
City      New York
Salary       65000
Name: 0, dtype: object

In [51]:
df1.loc[[1,2]]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
2  Peter   29  Berlin   62000

`selecting subsets of rows and columns`

In [52]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [53]:
df1.loc[[0,1]] [['City','Salary']]

       City  Salary
0  New York   65000
1     Paris   70000

In [57]:
#  conditional selection -> people whose age is > 30
df1[df1['Age'] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [60]:
df1

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [67]:
# person only whith age > 30 and salary>70000
df1 [(df1['Age']>30) & (df1['Salary'] == 70000)]

   Name  Age   City  Salary
1  Anna   34  Paris   70000